package gitHub;

public class Day01_about_JAVA {
	public static void main(String[] args) {
	
		
		/* 
		 * 	CPU VS 하드디스크
		 * 	CPU중앙처리장치 : 계산기 기능인 메모리이다. 전기가 지속적으로 보급이 안될경우 휘발성으로 데이터가 다 날라간다.(컴퓨터 전원이 꺼질경우)
		 *  하드디스크 : 저장이 가능한 메모리 전기가 지속적으로 보급이 안되어도 비휘발성으로 데이터를 보관한다. 
		 * 
		 * 	객체지향 프로그램은 아래의 언어들로 나눠진다.
		 * 	컴파일언어 vs 인터프리터 언어
		 * 	컴파일언어 		: 코드 모든 내용을 다 스캔하여 해석을 한다. 그래서 하나의 오타가 있음 파일이 실행자체가 불가능함(유지보수가 어렵다) JAVA
		 * 	인터프리터언어	: 코드한줄씩 스캔하여 해석한다. 그래서 오타가 있을 경우 그 부분만 실행이 안됨 (유지보수가 쉽다) Python
		 * 
		 * 	JDK 자바개발키트 
		 * 	JRE	자바런타임임바이먼트(자바실행환경)
		 * 
		 * 	JDK 특징 : JRE를 포함하고 있고 JAVA를 개발하는 툴
		 * 	JRE 특징 : JVM으로 자바코드를 컴파일 한다.
		 * 
		 * 	자바의 실행구조 
		 * 	- 소스파일 -> 컴파일 -> 클래스파일 -> 각자의 JVM으로 실행
		 * 
		 * 	cmd로 JAVA를 실행시키는 방법
		 * 	- txt파일에 자바코드 작성 -> .txt를 .java로 확장명변환 ->  javac^~확장명을 바꾼 파일을 작성 -> class가 만들어지면 java^파일명만 작성
		 *  
		 *  ex) D:\test> 1. javac Hello.java 2. java Hello 
		 * 
		 * */
		
	}
}
